291A-hw3/app/controllers/auth_controller.rb

  def register
    user = User.new(user_params)

    if user.save
      # Create expert profile for new user
      user.create_expert_profile!
---
INSERT INTO `users` (`created_at`, `last_active_at`, `password_digest`, `updated_at`, `username`) VALUES ('2025-12-12 06:39:40.256790', '2025-12-12 06:39:40.256799', '$2a$04$9N1ju7CbBWOb8q8EjVsKiu48fa3T7nHWONGKLX4gnlg3BI2OArEjC', '2025-12-12 06:39:40.256790', 'newuser')
INSERT INTO `expert_profiles` (`bio`, `created_at`, `expert_faq`, `expertise_summary`, `knowledge_base_links`, `updated_at`, `user_id`) VALUES (NULL, '2025-12-12 06:39:40.257669', NULL, NULL, NULL, '2025-12-12 06:39:40.257669', 68)

  def login
    user = User.find_by(username: params[:username])

    if user&.authenticate(params[:password])
      # Set session
      session[:user_id] = user.id

      # Update last active
      user.update(last_active_at: Time.current)
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'testuser' LIMIT 1
UPDATE `users` SET `users`.`last_active_at` = '2025-12-12 06:39:40.285065', `users`.`updated_at` = '2025-12-12 06:39:40.285196' WHERE `users`.`id` = 70