291A-hw3/app/controllers/conversations_controller.rb

SELECT `conversations`.* FROM `conversations` WHERE (`conversations`.`initiator_id` = 79 OR `conversations`.`assigned_expert_id` = 79) ORDER BY `conversations`.`updated_at` DESC
---
  def index
    # Get all conversations where user is initiator or assigned expert
    conversations = Conversation.where(initiator_id: current_user.id)
                                .or(Conversation.where(assigned_expert_id: current_user.id))
                                .order(updated_at: :desc)

INSERT INTO `conversations` (`assigned_expert_id`, `created_at`, `initiator_id`, `last_message_at`, `status`, `title`, `updated_at`) VALUES (NULL, '2025-12-12 06:39:40.386146', 80, NULL, 'waiting', 'Test Conversation', '2025-12-12 06:39:40.386146')
INSERT INTO `users` (`created_at`, `last_active_at`, `password_digest`, `updated_at`, `username`) VALUES ('2025-12-12 06:39:40.384755', '2025-12-12 06:39:40.384833', '$2a$04$.HwWxkFpEpYnqUPALbBeLusxESBJYQoa7/0XFdjXdCPaN3Vu5q0CS', '2025-12-12 06:39:40.384755', 'testuser')
---
  def create
    conversation = current_user.initiated_conversations.new(conversation_params)

    if conversation.save

SELECT `conversations`.* FROM `conversations` WHERE (`conversations`.`initiator_id` = 33 OR `conversations`.`assigned_expert_id` = 33) ORDER BY `conversations`.`updated_at` DESC
---
  def set_conversation
    @conversation = Conversation.where(initiator_id: current_user.id)
                                .or(Conversation.where(assigned_expert_id: current_user.id))
                                .find_by(id: params[:id])