291A-hw3/app/controllers/expert_controller.rb

  def queue
    waiting_conversations = Conversation.where(status: "waiting")
                                       .order(created_at: :asc)

    assigned_conversations = Conversation.where(assigned_expert_id: current_user.id, status: "active")
                                        .order(updated_at: :desc)
---
SELECT `conversations`.* FROM `conversations` WHERE `conversations`.`status` = 'waiting' ORDER BY `conversations`.`created_at` ASC
SELECT `conversations`.* FROM `conversations` WHERE `conversations`.`assigned_expert_id` = 21 AND `conversations`.`status` = 'active' ORDER BY `conversations`.`updated_at` DESC

  def claim
    if @conversation.assigned_expert_id.present?
      render json: { error: "Conversation is already assigned to an expert" }, status: :unprocessable_entity
      return
    end

    # Update conversation status and assigned expert, touch will update updated_at
    @conversation.update!(assigned_expert_id: current_user.id, status: "active")

    # Create expert assignment record
    ExpertAssignment.create!(
      conversation: @conversation,
      expert: current_user,
      status: "active"
    )
---
UPDATE `conversations` SET `conversations`.`assigned_expert_id` = 2, `conversations`.`status` = 'active', `conversations`.`updated_at` = '2025-12-12 06:39:40.632834' WHERE `conversations`.`id` = 1
INSERT INTO `conversations` (`assigned_expert_id`, `created_at`, `initiator_id`, `last_message_at`, `status`, `title`, `updated_at`) VALUES (NULL, '2025-12-12 06:39:40.633767', 1, NULL, 'waiting', 'Test', '2025-12-12 06:39:40.633767')
INSERT INTO `expert_assignments` (`assigned_at`, `conversation_id`, `created_at`, `expert_id`, `resolved_at`, `status`, `updated_at`) VALUES ('2025-12-12 06:39:40.670990', 1, '2025-12-12 06:39:40.671101', 2, NULL, 'active', '2025-12-12 06:39:40.671101')
INSERT INTO `users` (`created_at`, `last_active_at`, `password_digest`, `updated_at`, `username`) VALUES ('2025-12-12 06:39:40.564024', '2025-12-12 06:39:40.564034', '$2a$04$bUNSpehqKzyC/ucQQ5xRCO3vPRiCWNUEP3MXoewjWSCpAgoLrTHcy', '2025-12-12 06:39:40.564024', 'expertuser')

  def unclaim
    unless @conversation.assigned_expert_id == current_user.id
      render json: { error: "You are not assigned to this conversation" }, status: :forbidden
      return
    end

    # Update conversation status, touch will update updated_at
    @conversation.update!(assigned_expert_id: nil, status: "waiting")

    # Update expert assignment to resolved
    assignment = @conversation.expert_assignments.find_by(expert_id: current_user.id, status: "active")
---
UPDATE `conversations` SET `conversations`.`assigned_expert_id` = NULL, `conversations`.`status` = 'waiting', `conversations`.`updated_at` = '2025-12-12 06:39:40.475710' WHERE `conversations`.`id` = 3
SELECT `expert_assignments`.* FROM `expert_assignments` WHERE `expert_assignments`.`conversation_id` = 3 AND `expert_assignments`.`expert_id` = 8 AND `expert_assignments`.`status` = 'active' LIMIT 1

  def update_profile
    profile = current_user.expert_profile

    unless profile
      render json: { error: "Expert profile not found" }, status: :not_found
      return
    end

    if profile.update(profile_params)
---
UPDATE `expert_profiles` SET `expert_profiles`.`bio` = 'Updated bio', `expert_profiles`.`knowledge_base_links` = '[\"https://newlink.com\"]', `expert_profiles`.`updated_at` = '2025-12-12 06:39:40.573745' WHERE `expert_profiles`.`id` = 35

  def assignment_history
    assignments = current_user.expert_assignments.includes(:conversation).order(assigned_at: :desc)
---
SELECT `conversations`.* FROM `conversations` WHERE `conversations`.`id` IN (52, 51, 50)
SELECT `expert_assignments`.* FROM `expert_assignments` WHERE `expert_assignments`.`expert_id` = 100 ORDER BY `expert_assignments`.`assigned_at` DESC

  def set_conversation
    @conversation = Conversation.find_by(id: params[:conversation_id])
---
SELECT `conversations`.* FROM `conversations` WHERE `conversations`.`id` = 49 LIMIT 1