291A-hw3/app/controllers/messages_controller.rb

SELECT `messages`.* FROM `messages` WHERE `messages`.`conversation_id` = 6 ORDER BY `messages`.`created_at` ASC
---
  def index
    messages = @conversation.messages.includes(:sender).order(created_at: :asc)

SELECT `conversations`.* FROM `conversations` WHERE `conversations`.`id` = 4 LIMIT 1
INSERT INTO `conversations` (`assigned_expert_id`, `created_at`, `initiator_id`, `last_message_at`, `status`, `title`, `updated_at`) VALUES (20, '2025-12-12 06:43:22.911667', 19, NULL, 'active', 'Test Conversation', '2025-12-12 06:43:22.911667')
INSERT INTO `messages` (`content`, `conversation_id`, `created_at`, `is_read`, `sender_id`, `sender_role`, `updated_at`) VALUES ('Test message', 5, '2025-12-12 06:39:40.121230', FALSE, 5, 'initiator', '2025-12-12 06:39:40.121230')
---
  def create
    conversation = Conversation.find_by(id: params[:conversationId])

    unless conversation
      render json: { error: "Conversation not found" }, status: :not_found
      return
    end

    # Check if user has access to this conversation
    unless conversation.initiator_id == current_user.id || conversation.assigned_expert_id == current_user.id
      render json: { error: "Forbidden" }, status: :forbidden
      return
    end

    # Determine sender role
    sender_role = conversation.initiator_id == current_user.id ? "initiator" : "expert"

    message = conversation.messages.new(
      sender: current_user,
      sender_role: sender_role,
      content: params[:content]
    )

    if message.save

UPDATE `messages` SET `messages`.`is_read` = TRUE, `messages`.`updated_at` = '2025-12-12 06:43:22.926711' WHERE `messages`.`id` = 2
---
  def mark_read
    # Cannot mark your own messages as read
    if @message.sender_id == current_user.id
      render json: { error: "Cannot mark your own messages as read" }, status: :forbidden
      return
    end

    @message.update(is_read: true)

SELECT `conversations`.* FROM `conversations` WHERE (`conversations`.`initiator_id` = 48 OR `conversations`.`assigned_expert_id` = 48) AND `conversations`.`id` = 24 LIMIT 1
---
  def set_conversation
    @conversation = Conversation.where(initiator_id: current_user.id)
                                .or(Conversation.where(assigned_expert_id: current_user.id))
                                .find_by(id: params[:conversation_id])

SELECT `messages`.* FROM `messages` INNER JOIN `conversations` ON `conversations`.`id` = `messages`.`conversation_id` WHERE (conversations.initiator_id = '55' OR conversations.assigned_expert_id = '55') AND `messages`.`id` = 12 LIMIT 1
---
  def set_message
    @message = Message.joins(:conversation)
                     .where("conversations.initiator_id = ? OR conversations.assigned_expert_id = ?",
                            current_user.id, current_user.id)
                     .find_by(id: params[:id])