291A-hw3/app/controllers/updates_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
SELECT `conversations`.* FROM `conversations` WHERE (`conversations`.`initiator_id` = 7 OR `conversations`.`assigned_expert_id` = 7) AND (updated_at >= '1970-01-01 00:00:00') ORDER BY `conversations`.`updated_at` DESC
---
  def conversations_updates
    user_id = params[:userId]
    since = params[:since] ? Time.parse(params[:since]) : Time.at(0)

    user = User.find_by(id: user_id)
    unless user
      render json: { error: "User not found" }, status: :not_found
      return
    end

    # Get conversations updated since the given timestamp (inclusive)
    conversations = Conversation.where(initiator_id: user.id)
                                .or(Conversation.where(assigned_expert_id: user.id))
                                .where("updated_at >= ?", since)
                                .order(updated_at: :desc)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 17 LIMIT 1
SELECT `conversations`.`id` FROM `conversations` WHERE (`conversations`.`initiator_id` = 17 OR `conversations`.`assigned_expert_id` = 17)
SELECT `messages`.* FROM `messages` WHERE `messages`.`conversation_id` = 12 AND (created_at >= '1970-01-01 00:00:00') ORDER BY `messages`.`created_at` DESC
SELECT `conversations`.* FROM `conversations` WHERE `conversations`.`assigned_expert_id` = 29 AND `conversations`.`status` = 'active' AND (updated_at >= '1970-01-01 00:00:00') ORDER BY `conversations`.`updated_at` DESC
---
  def messages_updates
    user_id = params[:userId]
    since = params[:since] ? Time.parse(params[:since]) : Time.at(0)

    user = User.find_by(id: user_id)
    unless user
      render json: { error: "User not found" }, status: :not_found
      return
    end

    # Get messages from conversations the user is part of, created since the given timestamp (inclusive)
    conversation_ids = Conversation.where(initiator_id: user.id)
                                   .or(Conversation.where(assigned_expert_id: user.id))
                                   .pluck(:id)

    messages = Message.where(conversation_id: conversation_ids)
                     .where("created_at >= ?", since)
                     .includes(:sender)
                     .order(created_at: :desc)

    render json: messages.map { |m| message_json(m) }, status: :ok

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `conversations`.* FROM `conversations` WHERE `conversations`.`status` = 'waiting' AND (updated_at >= '1970-01-01 00:00:00') ORDER BY `conversations`.`created_at` ASC
SELECT `conversations`.* FROM `conversations` WHERE `conversations`.`assigned_expert_id` = 2 AND `conversations`.`status` = 'active' AND (updated_at >= '1970-01-01 00:00:00') ORDER BY `conversations`.`updated_at` DESC
---
  def expert_queue_updates
    expert_id = params[:expertId]
    since = params[:since] ? Time.parse(params[:since]) : Time.at(0)

    expert = User.find_by(id: expert_id)
    unless expert
      render json: { error: "Expert not found" }, status: :not_found
      return
    end

    # Get waiting conversations updated since timestamp (inclusive)
    waiting_conversations = Conversation.where(status: "waiting")
                                       .where("updated_at >= ?", since)
                                       .order(created_at: :asc)

    # Get assigned conversations updated since timestamp (inclusive)
    assigned_conversations = Conversation.where(assigned_expert_id: expert.id, status: "active")
                                        .where("updated_at >= ?", since)
                                        .order(updated_at: :desc)